---
kind: method
id: M:Autodesk.Revit.DB.FilterStringBeginsWith.#ctor
source: html/aa6a29b5-93f5-e6e8-30c1-5684604c5467.htm
---
# Autodesk.Revit.DB.FilterStringBeginsWith.#ctor Method

Constructs an instance of FilterStringBeginsWith.

## Syntax (C#)
```csharp
public FilterStringBeginsWith()
```